IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/MSP432/SYSCTL_A_356.0.xml
<module id="SYSCTL_A" HW_revision="356.0">
    <register id="SYS_REBOOT_CTL" width="32" offset="0x0" internal="0" description="Reboot Control Register">
        <bitfield id="REBOOT" description="Write 1 initiates a Reboot of the device" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="WKEY" description="Key to enable writes to bit 0" begin="15" end="8" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYS_NMI_CTLSTAT" width="32" offset="0x4" internal="0" description="NMI Control and Status Register">
        <bitfield id="CS_SRC" description="CS interrupt as a source of NMI" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disables CS interrupt as a source of NMI"/>
            <bitenum id="ENABLE" value="0x1" description="Enables CS interrupt as a source of NMI"/>
        </bitfield>
        <bitfield id="PSS_SRC" description="PSS interrupt as a source of NMI" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disables the PSS interrupt as a source of NMI"/>
            <bitenum id="ENABLE" value="0x1" description="Enables the PSS interrupt as a source of NMI"/>
        </bitfield>
        <bitfield id="PCM_SRC" description="PCM interrupt as a source of NMI" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disbles the PCM interrupt as a source of NMI"/>
            <bitenum id="ENABLE" value="0x1" description="Enables the PCM interrupt as a source of NMI"/>
        </bitfield>
        <bitfield id="PIN_SRC" description="RSTn/NMI pin configuration Note: When the device enters LPM3/LPM4 modes of operation, the functionality selected by this bit is retained. If selected as an NMI, activity on this pin in  LPM3/LPM4 wakes the device and processes the interrupt, without causing a POR. If selected as a Reset, activity on this pin in LPM3/LPM4 causes a device-level POR When the device enters LPM3.5/LPM4.5 modes of operation, this bit is always cleared to 0. In other words, the RSTn/NMI pin always assumes a reset functionality in LPM3.5/LPM4.5 modes." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="POR" value="0x0" description="Configures the RSTn_NMI pin as a source of POR Class Reset"/>
            <bitenum id="NMI" value="0x1" description="Configures the RSTn_NMI pin as a source of NMI"/>
        </bitfield>
        <bitfield id="CS_FLG" description="CS interrupt was the source of NMI" begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="CS_FLG_0" value="0x0" description="indicates CS interrupt was not the source of NMI"/>
            <bitenum id="CS_FLG_1" value="0x1" description="indicates CS interrupt was the source of NMI"/>
        </bitfield>
        <bitfield id="PSS_FLG" description="PSS interrupt was the source of NMI" begin="17" end="17" width="1" rwaccess="R">
            <bitenum id="PSS_FLG_0" value="0x0" description="indicates the PSS interrupt was not the source of NMI"/>
            <bitenum id="PSS_FLG_1" value="0x1" description="indicates the PSS interrupt was the source of NMI"/>
        </bitfield>
        <bitfield id="PCM_FLG" description="PCM interrupt was the source of NMI" begin="18" end="18" width="1" rwaccess="R">
            <bitenum id="PCM_FLG_0" value="0x0" description="indicates the PCM interrupt was not the source of NMI"/>
            <bitenum id="PCM_FLG_1" value="0x1" description="indicates the PCM interrupt was the source of NMI"/>
        </bitfield>
        <bitfield id="PIN_FLG" description="RSTn/NMI pin was the source of NMI" begin="19" end="19" width="1" rwaccess="R/W">
            <bitenum id="PIN_FLG_0" value="0x0" description="Indicates the RSTn_NMI pin was not the source of NMI"/>
            <bitenum id="PIN_FLG_1" value="0x1" description="Indicates the RSTn_NMI pin was the source of NMI"/>
        </bitfield>
    </register>
    <register id="SYS_WDTRESET_CTL" width="32" offset="0x8" internal="0" description="Watchdog Reset Control Register">
        <bitfield id="TIMEOUT" description="WDT timeout reset type" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="SOFT" value="0x0" description="WDT timeout event generates Soft reset"/>
            <bitenum id="HARD" value="0x1" description="WDT timeout event generates Hard reset"/>
        </bitfield>
        <bitfield id="VIOLATION" description="WDT password violation reset type" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="SOFT" value="0x0" description="WDT password violation event generates Soft reset"/>
            <bitenum id="HARD" value="0x1" description="WDT password violation event generates Hard reset"/>
        </bitfield>
    </register>
    <register id="SYS_PERIHALT_CTL" width="32" offset="0xC" internal="0" description="Peripheral Halt Control Register">
        <bitfield id="HALT_T16_0" description="Freezes IP operation when CPU is halted" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="HALT_T16_0_0" value="0x0" description="IP operation unaffected when CPU is halted"/>
            <bitenum id="HALT_T16_0_1" value="0x1" description="freezes IP operation when CPU is halted"/>
        </bitfield>
        <bitfield id="HALT_T16_1" description="Freezes IP operation when CPU is halted" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="HALT_T16_1_0" value="0x0" description="IP operation unaffected when CPU is halted"/>
            <bitenum id="HALT_T16_1_1" value="0x1" description="freezes IP operation when CPU is halted"/>
        </bitfield>
        <bitfield id="HALT_T16_2" description="Freezes IP operation when CPU is halted" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="HALT_T16_2_0" value="0x0" description="IP operation unaffected when CPU is halted"/>
            <bitenum id="HALT_T16_2_1" value="0x1" description="freezes IP operation when CPU is halted"/>
        </bitfield>
        <bitfield id="HALT_T16_3" description="Freezes IP operation when CPU is halted" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="HALT_T16_3_0" value="0x0" description="IP operation unaffected when CPU is halted"/>
            <bitenum id="HALT_T16_3_1" value="0x1" description="freezes IP operation when CPU is halted"/>
        </bitfield>
        <bitfield id="HALT_T32_0" description="Freezes IP operation when CPU is halted" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="HALT_T32_0_0" value="0x0" description="IP operation unaffected when CPU is halted"/>
            <bitenum id="HALT_T32_0_1" value="0x1" description="freezes IP operation when CPU is halted"/>
        </bitfield>
        <bitfield id="HALT_eUA0" description="Freezes IP operation when CPU is halted" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="HALT_eUA0_0" value="0x0" description="IP operation unaffected when CPU is halted"/>
            <bitenum id="HALT_eUA0_1" value="0x1" description="freezes IP operation when CPU is halted"/>
        </bitfield>
        <bitfield id="HALT_eUA1" description="Freezes IP operation when CPU is halted" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="HALT_eUA1_0" value="0x0" description="IP operation unaffected when CPU is halted"/>
            <bitenum id="HALT_eUA1_1" value="0x1" description="freezes IP operation when CPU is halted"/>
        </bitfield>
        <bitfield id="HALT_eUA2" description="Freezes IP operation when CPU is halted" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="HALT_eUA2_0" value="0x0" description="IP operation unaffected when CPU is halted"/>
            <bitenum id="HALT_eUA2_1" value="0x1" description="freezes IP operation when CPU is halted"/>
        </bitfield>
        <bitfield id="HALT_eUA3" description="Freezes IP operation when CPU is halted" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="HALT_eUA3_0" value="0x0" description="IP operation unaffected when CPU is halted"/>
            <bitenum id="HALT_eUA3_1" value="0x1" description="freezes IP operation when CPU is halted"/>
        </bitfield>
        <bitfield id="HALT_eUB0" description="Freezes IP operation when CPU is halted" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="HALT_eUB0_0" value="0x0" description="IP operation unaffected when CPU is halted"/>
            <bitenum id="HALT_eUB0_1" value="0x1" description="freezes IP operation when CPU is halted"/>
        </bitfield>
        <bitfield id="HALT_eUB1" description="Freezes IP operation when CPU is halted" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="HALT_eUB1_0" value="0x0" description="IP operation unaffected when CPU is halted"/>
            <bitenum id="HALT_eUB1_1" value="0x1" description="freezes IP operation when CPU is halted"/>
        </bitfield>
        <bitfield id="HALT_eUB2" description="Freezes IP operation when CPU is halted" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="HALT_eUB2_0" value="0x0" description="IP operation unaffected when CPU is halted"/>
            <bitenum id="HALT_eUB2_1" value="0x1" description="freezes IP operation when CPU is halted"/>
        </bitfield>
        <bitfield id="HALT_eUB3" description="Freezes IP operation when CPU is halted" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="HALT_eUB3_0" value="0x0" description="IP operation unaffected when CPU is halted"/>
            <bitenum id="HALT_eUB3_1" value="0x1" description="freezes IP operation when CPU is halted"/>
        </bitfield>
        <bitfield id="HALT_ADC" description="Freezes IP operation when CPU is halted" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="HALT_ADC_0" value="0x0" description="IP operation unaffected when CPU is halted"/>
            <bitenum id="HALT_ADC_1" value="0x1" description="freezes IP operation when CPU is halted"/>
        </bitfield>
        <bitfield id="HALT_WDT" description="Freezes IP operation when CPU is halted" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="HALT_WDT_0" value="0x0" description="IP operation unaffected when CPU is halted"/>
            <bitenum id="HALT_WDT_1" value="0x1" description="freezes IP operation when CPU is halted"/>
        </bitfield>
        <bitfield id="HALT_DMA" description="Freezes IP operation when CPU is halted" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="HALT_DMA_0" value="0x0" description="IP operation unaffected when CPU is halted"/>
            <bitenum id="HALT_DMA_1" value="0x1" description="freezes IP operation when CPU is halted"/>
        </bitfield>
        <bitfield id="HALT_LCD" description="Freezes IP operation when CPU is halted" begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="HALT_LCD_0" value="0x0" description="IP operation unaffected when CPU is halted"/>
            <bitenum id="HALT_LCD_1" value="0x1" description="freezes IP operation when CPU is halted"/>
        </bitfield>
    </register>
    <register id="SYS_SRAM_SIZE" width="32" offset="0x10" internal="0" description="SRAM Size Register">
    </register>
