IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/MSP432/SYSCTL_A_356.0.xml
    <register id="SYS_SRAM_NUMBANKS" width="32" offset="0x14" internal="0" description="SRAM Number of Banks Register">
    </register>
    <register id="SYS_SRAM_NUMBLOCKS" width="32" offset="0x18" internal="0" description="SRAM Number of Blocks Register">
    </register>
    <register id="SYS_MAINFLASH_SIZE" width="32" offset="0x20" internal="0" description="Flash Main Memory Size Register">
    </register>
    <register id="SYS_INFOFLASH_SIZE" width="32" offset="0x24" internal="0" description="Flash Information Memory Size Register">
    </register>
    <register id="SYS_DIO_GLTFLT_CTL" width="32" offset="0x30" internal="0" description="Digital I/O Glitch Filter Control Register">
        <bitfield id="GLTCH_EN" description="Glitch filter enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="GLTCH_EN_0" value="0x0" description="Disables glitch filter on the digital I/Os"/>
            <bitenum id="GLTCH_EN_1" value="0x1" description="Enables glitch filter on the digital I/Os"/>
        </bitfield>
    </register>
    <register id="SYS_SECDATA_UNLOCK" width="32" offset="0x40" internal="0" description="IP Protected Secure Zone Data Access Unlock Register">
        <bitfield id="UNLKEY" description="Unlock key" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYS_SRAM_BANKEN_CTL0" width="32" offset="0x50" internal="0" description="SRAM Bank Enable Control Register 0">
        <bitfield id="BNK0_EN" description="When 1, enables Bank0 of the SRAM" begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="BNK1_EN" description="When 1, enables Bank1 of the SRAM" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="BNK1_EN_0" value="0x0" description="Disables Bank1 of the SRAM"/>
            <bitenum id="BNK1_EN_1" value="0x1" description="Enables Bank1 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK2_EN" description="When 1, enables Bank2 of the SRAM" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="BNK2_EN_0" value="0x0" description="Disables Bank2 of the SRAM"/>
            <bitenum id="BNK2_EN_1" value="0x1" description="Enables Bank2 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK3_EN" description="When 1, enables Bank3 of the SRAM" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="BNK3_EN_0" value="0x0" description="Disables Bank3 of the SRAM"/>
            <bitenum id="BNK3_EN_1" value="0x1" description="Enables Bank3 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK4_EN" description="When 1, enables Bank4 of the SRAM" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="BNK4_EN_0" value="0x0" description="Disables Bank4 of the SRAM"/>
            <bitenum id="BNK4_EN_1" value="0x1" description="Enables Bank4 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK5_EN" description="When 1, enables Bank5 of the SRAM" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="BNK5_EN_0" value="0x0" description="Disables Bank5 of the SRAM"/>
            <bitenum id="BNK5_EN_1" value="0x1" description="Enables Bank5 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK6_EN" description="When 1, enables Bank6 of the SRAM" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="BNK6_EN_0" value="0x0" description="Disables Bank6 of the SRAM"/>
            <bitenum id="BNK6_EN_1" value="0x1" description="Enables Bank6 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK7_EN" description="When 1, enables Bank7 of the SRAM" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="BNK7_EN_0" value="0x0" description="Disables Bank7 of the SRAM"/>
            <bitenum id="BNK7_EN_1" value="0x1" description="Enables Bank7 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK8_EN" description="When 1, enables Bank8 of the SRAM" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="BNK8_EN_0" value="0x0" description="Disables Bank8 of the SRAM"/>
            <bitenum id="BNK8_EN_1" value="0x1" description="Enables Bank8 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK9_EN" description="When 1, enables Bank9 of the SRAM" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="BNK9_EN_0" value="0x0" description="Disables Bank9 of the SRAM"/>
            <bitenum id="BNK9_EN_1" value="0x1" description="Enables Bank9 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK10_EN" description="When 1, enables Bank10 of the SRAM" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="BNK10_EN_0" value="0x0" description="Disables Bank10 of the SRAM"/>
            <bitenum id="BNK10_EN_1" value="0x1" description="Enables Bank10 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK11_EN" description="When 1, enables Bank11 of the SRAM" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="BNK11_EN_0" value="0x0" description="Disables Bank11 of the SRAM"/>
            <bitenum id="BNK11_EN_1" value="0x1" description="Enables Bank11 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK12_EN" description="When 1, enables Bank12 of the SRAM" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="BNK12_EN_0" value="0x0" description="Disables Bank12 of the SRAM"/>
            <bitenum id="BNK12_EN_1" value="0x1" description="Enables Bank12 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK13_EN" description="When 1, enables Bank13 of the SRAM" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="BNK13_EN_0" value="0x0" description="Disables Bank13 of the SRAM"/>
            <bitenum id="BNK13_EN_1" value="0x1" description="Enables Bank13 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK14_EN" description="When 1, enables Bank14 of the SRAM" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="BNK14_EN_0" value="0x0" description="Disables Bank14 of the SRAM"/>
            <bitenum id="BNK14_EN_1" value="0x1" description="Enables Bank14 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK15_EN" description="When 1, enables Bank15 of the SRAM" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="BNK15_EN_0" value="0x0" description="Disables Bank15 of the SRAM"/>
            <bitenum id="BNK15_EN_1" value="0x1" description="Enables Bank15 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK16_EN" description="When 1, enables Bank16 of the SRAM" begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="BNK16_EN_0" value="0x0" description="Disables Bank16 of the SRAM"/>
            <bitenum id="BNK16_EN_1" value="0x1" description="Enables Bank16 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK17_EN" description="When 1, enables Bank17 of the SRAM" begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="BNK17_EN_0" value="0x0" description="Disables Bank17 of the SRAM"/>
            <bitenum id="BNK17_EN_1" value="0x1" description="Enables Bank17 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK18_EN" description="When 1, enables Bank18 of the SRAM" begin="18" end="18" width="1" rwaccess="R/W">
            <bitenum id="BNK18_EN_0" value="0x0" description="Disables Bank18 of the SRAM"/>
            <bitenum id="BNK18_EN_1" value="0x1" description="Enables Bank18 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK19_EN" description="When 1, enables Bank19 of the SRAM" begin="19" end="19" width="1" rwaccess="R/W">
            <bitenum id="BNK19_EN_0" value="0x0" description="Disables Bank19 of the SRAM"/>
            <bitenum id="BNK19_EN_1" value="0x1" description="Enables Bank19 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK20_EN" description="When 1, enables Bank20 of the SRAM" begin="20" end="20" width="1" rwaccess="R/W">
            <bitenum id="BNK20_EN_0" value="0x0" description="Disables Bank20 of the SRAM"/>
            <bitenum id="BNK20_EN_1" value="0x1" description="Enables Bank20 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK21_EN" description="When 1, enables Bank21 of the SRAM" begin="21" end="21" width="1" rwaccess="R/W">
            <bitenum id="BNK21_EN_0" value="0x0" description="Disables Bank21 of the SRAM"/>
            <bitenum id="BNK21_EN_1" value="0x1" description="Enables Bank21 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK22_EN" description="When 1, enables Bank22 of the SRAM" begin="22" end="22" width="1" rwaccess="R/W">
            <bitenum id="BNK22_EN_0" value="0x0" description="Disables Bank22 of the SRAM"/>
            <bitenum id="BNK22_EN_1" value="0x1" description="Enables Bank22 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK23_EN" description="When 1, enables Bank23 of the SRAM" begin="23" end="23" width="1" rwaccess="R/W">
            <bitenum id="BNK23_EN_0" value="0x0" description="Disables Bank23 of the SRAM"/>
            <bitenum id="BNK23_EN_1" value="0x1" description="Enables Bank23 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK24_EN" description="When 1, enables Bank24 of the SRAM" begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="BNK24_EN_0" value="0x0" description="Disables Bank24 of the SRAM"/>
            <bitenum id="BNK24_EN_1" value="0x1" description="Enables Bank24 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK25_EN" description="When 1, enables Bank25 of the SRAM" begin="25" end="25" width="1" rwaccess="R/W">
            <bitenum id="BNK25_EN_0" value="0x0" description="Disables Bank25 of the SRAM"/>
            <bitenum id="BNK25_EN_1" value="0x1" description="Enables Bank25 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK26_EN" description="When 1, enables Bank26 of the SRAM" begin="26" end="26" width="1" rwaccess="R/W">
            <bitenum id="BNK26_EN_0" value="0x0" description="Disables Bank26 of the SRAM"/>
            <bitenum id="BNK26_EN_1" value="0x1" description="Enables Bank26 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK27_EN" description="When 1, enables Bank27 of the SRAM" begin="27" end="27" width="1" rwaccess="R/W">
            <bitenum id="BNK27_EN_0" value="0x0" description="Disables Bank27 of the SRAM"/>
            <bitenum id="BNK27_EN_1" value="0x1" description="Enables Bank27 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK28_EN" description="When 1, enables Bank28 of the SRAM" begin="28" end="28" width="1" rwaccess="R/W">
            <bitenum id="BNK28_EN_0" value="0x0" description="Disables Bank28 of the SRAM"/>
            <bitenum id="BNK28_EN_1" value="0x1" description="Enables Bank28 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK29_EN" description="When 1, enables Bank29 of the SRAM" begin="29" end="29" width="1" rwaccess="R/W">
            <bitenum id="BNK29_EN_0" value="0x0" description="Disables Bank29 of the SRAM"/>
            <bitenum id="BNK29_EN_1" value="0x1" description="Enables Bank29 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK30_EN" description="When 1, enables Bank30 of the SRAM" begin="30" end="30" width="1" rwaccess="R/W">
            <bitenum id="BNK30_EN_0" value="0x0" description="Disables Bank30 of the SRAM"/>
            <bitenum id="BNK30_EN_1" value="0x1" description="Enables Bank30 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK31_EN" description="When 1, enables Bank31 of the SRAM" begin="31" end="31" width="1" rwaccess="R/W">
            <bitenum id="BNK31_EN_0" value="0x0" description="Disables Bank31 of the SRAM"/>
            <bitenum id="BNK31_EN_1" value="0x1" description="Enables Bank31 of the SRAM"/>
        </bitfield>
    </register>
