IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/MSP432/SYSCTL_A_356.0.xml
    <register id="SYS_SRAM_BANKEN_CTL1" width="32" offset="0x54" internal="0" description="SRAM Bank Enable Control Register 1">
        <bitfield id="BNK32_EN" description="When 1, enables Bank32 of the SRAM" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="BNK32_EN_0" value="0x0" description="Disables Bank32 of the SRAM"/>
            <bitenum id="BNK32_EN_1" value="0x1" description="Enables Bank32 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK33_EN" description="When 1, enables Bank33 of the SRAM" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="BNK33_EN_0" value="0x0" description="Disables Bank33 of the SRAM"/>
            <bitenum id="BNK33_EN_1" value="0x1" description="Enables Bank33 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK34_EN" description="When 1, enables Bank34 of the SRAM" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="BNK34_EN_0" value="0x0" description="Disables Bank34 of the SRAM"/>
            <bitenum id="BNK34_EN_1" value="0x1" description="Enables Bank34 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK35_EN" description="When 1, enables Bank35 of the SRAM" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="BNK35_EN_0" value="0x0" description="Disables Bank35 of the SRAM"/>
            <bitenum id="BNK35_EN_1" value="0x1" description="Enables Bank35 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK36_EN" description="When 1, enables Bank36 of the SRAM" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="BNK36_EN_0" value="0x0" description="Disables Bank36 of the SRAM"/>
            <bitenum id="BNK36_EN_1" value="0x1" description="Enables Bank36 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK37_EN" description="When 1, enables Bank37 of the SRAM" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="BNK37_EN_0" value="0x0" description="Disables Bank37 of the SRAM"/>
            <bitenum id="BNK37_EN_1" value="0x1" description="Enables Bank37 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK38_EN" description="When 1, enables Bank38 of the SRAM" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="BNK38_EN_0" value="0x0" description="Disables Bank38 of the SRAM"/>
            <bitenum id="BNK38_EN_1" value="0x1" description="Enables Bank38 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK39_EN" description="When 1, enables Bank39 of the SRAM" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="BNK39_EN_0" value="0x0" description="Disables Bank39 of the SRAM"/>
            <bitenum id="BNK39_EN_1" value="0x1" description="Enables Bank39 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK40_EN" description="When 1, enables Bank40 of the SRAM" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="BNK40_EN_0" value="0x0" description="Disables Bank40 of the SRAM"/>
            <bitenum id="BNK40_EN_1" value="0x1" description="Enables Bank40 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK41_EN" description="When 1, enables Bank41 of the SRAM" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="BNK41_EN_0" value="0x0" description="Disables Bank41 of the SRAM"/>
            <bitenum id="BNK41_EN_1" value="0x1" description="Enables Bank41 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK42_EN" description="When 1, enables Bank42 of the SRAM" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="BNK42_EN_0" value="0x0" description="Disables Bank42 of the SRAM"/>
            <bitenum id="BNK42_EN_1" value="0x1" description="Enables Bank42 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK43_EN" description="When 1, enables Bank43 of the SRAM" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="BNK43_EN_0" value="0x0" description="Disables Bank43 of the SRAM"/>
            <bitenum id="BNK43_EN_1" value="0x1" description="Enables Bank43 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK44_EN" description="When 1, enables Bank44 of the SRAM" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="BNK44_EN_0" value="0x0" description="Disables Bank44 of the SRAM"/>
            <bitenum id="BNK44_EN_1" value="0x1" description="Enables Bank44 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK45_EN" description="When 1, enables Bank45 of the SRAM" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="BNK45_EN_0" value="0x0" description="Disables Bank45 of the SRAM"/>
            <bitenum id="BNK45_EN_1" value="0x1" description="Enables Bank45 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK46_EN" description="When 1, enables Bank46 of the SRAM" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="BNK46_EN_0" value="0x0" description="Disables Bank46 of the SRAM"/>
            <bitenum id="BNK46_EN_1" value="0x1" description="Enables Bank46 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK47_EN" description="When 1, enables Bank47 of the SRAM" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="BNK47_EN_0" value="0x0" description="Disables Bank47 of the SRAM"/>
            <bitenum id="BNK47_EN_1" value="0x1" description="Enables Bank47 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK48_EN" description="When 1, enables Bank48 of the SRAM" begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="BNK48_EN_0" value="0x0" description="Disables Bank48 of the SRAM"/>
            <bitenum id="BNK48_EN_1" value="0x1" description="Enables Bank48 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK49_EN" description="When 1, enables Bank49 of the SRAM" begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="BNK49_EN_0" value="0x0" description="Disables Bank49 of the SRAM"/>
            <bitenum id="BNK49_EN_1" value="0x1" description="Enables Bank49 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK50_EN" description="When 1, enables Bank50 of the SRAM" begin="18" end="18" width="1" rwaccess="R/W">
            <bitenum id="BNK50_EN_0" value="0x0" description="Disables Bank50 of the SRAM"/>
            <bitenum id="BNK50_EN_1" value="0x1" description="Enables Bank50 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK51_EN" description="When 1, enables Bank51 of the SRAM" begin="19" end="19" width="1" rwaccess="R/W">
            <bitenum id="BNK51_EN_0" value="0x0" description="Disables Bank51 of the SRAM"/>
            <bitenum id="BNK51_EN_1" value="0x1" description="Enables Bank51 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK52_EN" description="When 1, enables Bank52 of the SRAM" begin="20" end="20" width="1" rwaccess="R/W">
            <bitenum id="BNK52_EN_0" value="0x0" description="Disables Bank52 of the SRAM"/>
            <bitenum id="BNK52_EN_1" value="0x1" description="Enables Bank52 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK53_EN" description="When 1, enables Bank53 of the SRAM" begin="21" end="21" width="1" rwaccess="R/W">
            <bitenum id="BNK53_EN_0" value="0x0" description="Disables Bank53 of the SRAM"/>
            <bitenum id="BNK53_EN_1" value="0x1" description="Enables Bank53 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK54_EN" description="When 1, enables Bank54 of the SRAM" begin="22" end="22" width="1" rwaccess="R/W">
            <bitenum id="BNK54_EN_0" value="0x0" description="Disables Bank54 of the SRAM"/>
            <bitenum id="BNK54_EN_1" value="0x1" description="Enables Bank54 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK55_EN" description="When 1, enables Bank55 of the SRAM" begin="23" end="23" width="1" rwaccess="R/W">
            <bitenum id="BNK55_EN_0" value="0x0" description="Disables Bank55 of the SRAM"/>
            <bitenum id="BNK55_EN_1" value="0x1" description="Enables Bank55 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK56_EN" description="When 1, enables Bank56 of the SRAM" begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="BNK56_EN_0" value="0x0" description="Disables Bank56 of the SRAM"/>
            <bitenum id="BNK56_EN_1" value="0x1" description="Enables Bank56 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK57_EN" description="When 1, enables Bank57 of the SRAM" begin="25" end="25" width="1" rwaccess="R/W">
            <bitenum id="BNK57_EN_0" value="0x0" description="Disables Bank57 of the SRAM"/>
            <bitenum id="BNK57_EN_1" value="0x1" description="Enables Bank57 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK58_EN" description="When 1, enables Bank58 of the SRAM" begin="26" end="26" width="1" rwaccess="R/W">
            <bitenum id="BNK58_EN_0" value="0x0" description="Disables Bank58 of the SRAM"/>
            <bitenum id="BNK58_EN_1" value="0x1" description="Enables Bank58 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK59_EN" description="When 1, enables Bank59 of the SRAM" begin="27" end="27" width="1" rwaccess="R/W">
            <bitenum id="BNK59_EN_0" value="0x0" description="Disables Bank59 of the SRAM"/>
            <bitenum id="BNK59_EN_1" value="0x1" description="Enables Bank59 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK60_EN" description="When 1, enables Bank60 of the SRAM" begin="28" end="28" width="1" rwaccess="R/W">
            <bitenum id="BNK60_EN_0" value="0x0" description="Disables Bank60 of the SRAM"/>
            <bitenum id="BNK60_EN_1" value="0x1" description="Enables Bank60 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK61_EN" description="When 1, enables Bank61 of the SRAM" begin="29" end="29" width="1" rwaccess="R/W">
            <bitenum id="BNK61_EN_0" value="0x0" description="Disables Bank61 of the SRAM"/>
            <bitenum id="BNK61_EN_1" value="0x1" description="Enables Bank61 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK62_EN" description="When 1, enables Bank62 of the SRAM" begin="30" end="30" width="1" rwaccess="R/W">
            <bitenum id="BNK62_EN_0" value="0x0" description="Disables Bank62 of the SRAM"/>
            <bitenum id="BNK62_EN_1" value="0x1" description="Enables Bank62 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK63_EN" description="When 1, enables Bank63 of the SRAM" begin="31" end="31" width="1" rwaccess="R/W">
            <bitenum id="BNK63_EN_0" value="0x0" description="Disables Bank63 of the SRAM"/>
            <bitenum id="BNK63_EN_1" value="0x1" description="Enables Bank63 of the SRAM"/>
        </bitfield>
    </register>
