IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/MSP432/SYSCTL_A_356.0.xml
    <register id="SYS_SRAM_BANKEN_CTL2" width="32" offset="0x58" internal="0" description="SRAM Bank Enable Control Register 2">
        <bitfield id="BNK64_EN" description="When 1, enables Bank64 of the SRAM" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="BNK64_EN_0" value="0x0" description="Disables Bank64 of the SRAM"/>
            <bitenum id="BNK64_EN_1" value="0x1" description="Enables Bank64 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK65_EN" description="When 1, enables Bank65 of the SRAM" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="BNK65_EN_0" value="0x0" description="Disables Bank65 of the SRAM"/>
            <bitenum id="BNK65_EN_1" value="0x1" description="Enables Bank65 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK66_EN" description="When 1, enables Bank66 of the SRAM" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="BNK66_EN_0" value="0x0" description="Disables Bank66 of the SRAM"/>
            <bitenum id="BNK66_EN_1" value="0x1" description="Enables Bank66 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK67_EN" description="When 1, enables Bank67 of the SRAM" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="BNK67_EN_0" value="0x0" description="Disables Bank67 of the SRAM"/>
            <bitenum id="BNK67_EN_1" value="0x1" description="Enables Bank67 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK68_EN" description="When 1, enables Bank68 of the SRAM" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="BNK68_EN_0" value="0x0" description="Disables Bank68 of the SRAM"/>
            <bitenum id="BNK68_EN_1" value="0x1" description="Enables Bank68 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK69_EN" description="When 1, enables Bank69 of the SRAM" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="BNK69_EN_0" value="0x0" description="Disables Bank69 of the SRAM"/>
            <bitenum id="BNK69_EN_1" value="0x1" description="Enables Bank69 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK70_EN" description="When 1, enables Bank70 of the SRAM" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="BNK70_EN_0" value="0x0" description="Disables Bank70 of the SRAM"/>
            <bitenum id="BNK70_EN_1" value="0x1" description="Enables Bank70 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK71_EN" description="When 1, enables Bank71 of the SRAM" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="BNK71_EN_0" value="0x0" description="Disables Bank71 of the SRAM"/>
            <bitenum id="BNK71_EN_1" value="0x1" description="Enables Bank71 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK72_EN" description="When 1, enables Bank72 of the SRAM" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="BNK72_EN_0" value="0x0" description="Disables Bank72 of the SRAM"/>
            <bitenum id="BNK72_EN_1" value="0x1" description="Enables Bank72 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK73_EN" description="When 1, enables Bank73 of the SRAM" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="BNK73_EN_0" value="0x0" description="Disables Bank73 of the SRAM"/>
            <bitenum id="BNK73_EN_1" value="0x1" description="Enables Bank73 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK74_EN" description="When 1, enables Bank74 of the SRAM" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="BNK74_EN_0" value="0x0" description="Disables Bank74 of the SRAM"/>
            <bitenum id="BNK74_EN_1" value="0x1" description="Enables Bank74 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK75_EN" description="When 1, enables Bank75 of the SRAM" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="BNK75_EN_0" value="0x0" description="Disables Bank75 of the SRAM"/>
            <bitenum id="BNK75_EN_1" value="0x1" description="Enables Bank75 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK76_EN" description="When 1, enables Bank76 of the SRAM" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="BNK76_EN_0" value="0x0" description="Disables Bank76 of the SRAM"/>
            <bitenum id="BNK76_EN_1" value="0x1" description="Enables Bank76 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK77_EN" description="When 1, enables Bank77 of the SRAM" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="BNK77_EN_0" value="0x0" description="Disables Bank77 of the SRAM"/>
            <bitenum id="BNK77_EN_1" value="0x1" description="Enables Bank77 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK78_EN" description="When 1, enables Bank78 of the SRAM" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="BNK78_EN_0" value="0x0" description="Disables Bank78 of the SRAM"/>
            <bitenum id="BNK78_EN_1" value="0x1" description="Enables Bank78 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK79_EN" description="When 1, enables Bank79 of the SRAM" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="BNK79_EN_0" value="0x0" description="Disables Bank79 of the SRAM"/>
            <bitenum id="BNK79_EN_1" value="0x1" description="Enables Bank79 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK80_EN" description="When 1, enables Bank80 of the SRAM" begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="BNK80_EN_0" value="0x0" description="Disables Bank80 of the SRAM"/>
            <bitenum id="BNK80_EN_1" value="0x1" description="Enables Bank80 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK81_EN" description="When 1, enables Bank81 of the SRAM" begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="BNK81_EN_0" value="0x0" description="Disables Bank81 of the SRAM"/>
            <bitenum id="BNK81_EN_1" value="0x1" description="Enables Bank81 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK82_EN" description="When 1, enables Bank82 of the SRAM" begin="18" end="18" width="1" rwaccess="R/W">
            <bitenum id="BNK82_EN_0" value="0x0" description="Disables Bank82 of the SRAM"/>
            <bitenum id="BNK82_EN_1" value="0x1" description="Enables Bank82 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK83_EN" description="When 1, enables Bank83 of the SRAM" begin="19" end="19" width="1" rwaccess="R/W">
            <bitenum id="BNK83_EN_0" value="0x0" description="Disables Bank83 of the SRAM"/>
            <bitenum id="BNK83_EN_1" value="0x1" description="Enables Bank83 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK84_EN" description="When 1, enables Bank84 of the SRAM" begin="20" end="20" width="1" rwaccess="R/W">
            <bitenum id="BNK84_EN_0" value="0x0" description="Disables Bank84 of the SRAM"/>
            <bitenum id="BNK84_EN_1" value="0x1" description="Enables Bank84 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK85_EN" description="When 1, enables Bank85 of the SRAM" begin="21" end="21" width="1" rwaccess="R/W">
            <bitenum id="BNK85_EN_0" value="0x0" description="Disables Bank85 of the SRAM"/>
            <bitenum id="BNK85_EN_1" value="0x1" description="Enables Bank85 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK86_EN" description="When 1, enables Bank86 of the SRAM" begin="22" end="22" width="1" rwaccess="R/W">
            <bitenum id="BNK86_EN_0" value="0x0" description="Disables Bank86 of the SRAM"/>
            <bitenum id="BNK86_EN_1" value="0x1" description="Enables Bank86 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK87_EN" description="When 1, enables Bank87 of the SRAM" begin="23" end="23" width="1" rwaccess="R/W">
            <bitenum id="BNK87_EN_0" value="0x0" description="Disables Bank87 of the SRAM"/>
            <bitenum id="BNK87_EN_1" value="0x1" description="Enables Bank87 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK88_EN" description="When 1, enables Bank88 of the SRAM" begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="BNK88_EN_0" value="0x0" description="Disables Bank88 of the SRAM"/>
            <bitenum id="BNK88_EN_1" value="0x1" description="Enables Bank88 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK89_EN" description="When 1, enables Bank89 of the SRAM" begin="25" end="25" width="1" rwaccess="R/W">
            <bitenum id="BNK89_EN_0" value="0x0" description="Disables Bank89 of the SRAM"/>
            <bitenum id="BNK89_EN_1" value="0x1" description="Enables Bank89 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK90_EN" description="When 1, enables Bank90 of the SRAM" begin="26" end="26" width="1" rwaccess="R/W">
            <bitenum id="BNK90_EN_0" value="0x0" description="Disables Bank90 of the SRAM"/>
            <bitenum id="BNK90_EN_1" value="0x1" description="Enables Bank90 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK91_EN" description="When 1, enables Bank91 of the SRAM" begin="27" end="27" width="1" rwaccess="R/W">
            <bitenum id="BNK91_EN_0" value="0x0" description="Disables Bank91 of the SRAM"/>
            <bitenum id="BNK91_EN_1" value="0x1" description="Enables Bank91 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK92_EN" description="When 1, enables Bank92 of the SRAM" begin="28" end="28" width="1" rwaccess="R/W">
            <bitenum id="BNK92_EN_0" value="0x0" description="Disables Bank92 of the SRAM"/>
            <bitenum id="BNK92_EN_1" value="0x1" description="Enables Bank92 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK93_EN" description="When 1, enables Bank93 of the SRAM" begin="29" end="29" width="1" rwaccess="R/W">
            <bitenum id="BNK93_EN_0" value="0x0" description="Disables Bank93 of the SRAM"/>
            <bitenum id="BNK93_EN_1" value="0x1" description="Enables Bank93 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK94_EN" description="When 1, enables Bank94 of the SRAM" begin="30" end="30" width="1" rwaccess="R/W">
            <bitenum id="BNK94_EN_0" value="0x0" description="Disables Bank94 of the SRAM"/>
            <bitenum id="BNK94_EN_1" value="0x1" description="Enables Bank94 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK95_EN" description="When 1, enables Bank95 of the SRAM" begin="31" end="31" width="1" rwaccess="R/W">
            <bitenum id="BNK95_EN_0" value="0x0" description="Disables Bank95 of the SRAM"/>
            <bitenum id="BNK95_EN_1" value="0x1" description="Enables Bank95 of the SRAM"/>
        </bitfield>
    </register>
