IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/MSP432/SYSCTL_A_356.0.xml
    <register id="SYS_SRAM_BANKEN_CTL3" width="32" offset="0x5C" internal="0" description="SRAM Bank Enable Control Register 3">
        <bitfield id="BNK96_EN" description="When 1, enables Bank96 of the SRAM" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="BNK96_EN_0" value="0x0" description="Disables Bank96 of the SRAM"/>
            <bitenum id="BNK96_EN_1" value="0x1" description="Enables Bank96 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK97_EN" description="When 1, enables Bank97 of the SRAM" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="BNK97_EN_0" value="0x0" description="Disables Bank97 of the SRAM"/>
            <bitenum id="BNK97_EN_1" value="0x1" description="Enables Bank97 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK98_EN" description="When 1, enables Bank98 of the SRAM" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="BNK98_EN_0" value="0x0" description="Disables Bank98 of the SRAM"/>
            <bitenum id="BNK98_EN_1" value="0x1" description="Enables Bank98 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK99_EN" description="When 1, enables Bank99 of the SRAM" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="BNK99_EN_0" value="0x0" description="Disables Bank99 of the SRAM"/>
            <bitenum id="BNK99_EN_1" value="0x1" description="Enables Bank99 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK100_EN" description="When 1, enables Bank100 of the SRAM" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="BNK100_EN_0" value="0x0" description="Disables Bank100 of the SRAM"/>
            <bitenum id="BNK100_EN_1" value="0x1" description="Enables Bank100 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK101_EN" description="When 1, enables Bank101 of the SRAM" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="BNK101_EN_0" value="0x0" description="Disables Bank101 of the SRAM"/>
            <bitenum id="BNK101_EN_1" value="0x1" description="Enables Bank101 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK102_EN" description="When 1, enables Bank102 of the SRAM" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="BNK102_EN_0" value="0x0" description="Disables Bank102 of the SRAM"/>
            <bitenum id="BNK102_EN_1" value="0x1" description="Enables Bank102 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK103_EN" description="When 1, enables Bank103 of the SRAM" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="BNK103_EN_0" value="0x0" description="Disables Bank103 of the SRAM"/>
            <bitenum id="BNK103_EN_1" value="0x1" description="Enables Bank103 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK104_EN" description="When 1, enables Bank104 of the SRAM" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="BNK104_EN_0" value="0x0" description="Disables Bank104 of the SRAM"/>
            <bitenum id="BNK104_EN_1" value="0x1" description="Enables Bank104 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK105_EN" description="When 1, enables Bank105 of the SRAM" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="BNK105_EN_0" value="0x0" description="Disables Bank105 of the SRAM"/>
            <bitenum id="BNK105_EN_1" value="0x1" description="Enables Bank105 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK106_EN" description="When 1, enables Bank106 of the SRAM" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="BNK106_EN_0" value="0x0" description="Disables Bank106 of the SRAM"/>
            <bitenum id="BNK106_EN_1" value="0x1" description="Enables Bank106 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK107_EN" description="When 1, enables Bank107 of the SRAM" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="BNK107_EN_0" value="0x0" description="Disables Bank107 of the SRAM"/>
            <bitenum id="BNK107_EN_1" value="0x1" description="Enables Bank107 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK108_EN" description="When 1, enables Bank108 of the SRAM" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="BNK108_EN_0" value="0x0" description="Disables Bank108 of the SRAM"/>
            <bitenum id="BNK108_EN_1" value="0x1" description="Enables Bank108 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK109_EN" description="When 1, enables Bank109 of the SRAM" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="BNK109_EN_0" value="0x0" description="Disables Bank109 of the SRAM"/>
            <bitenum id="BNK109_EN_1" value="0x1" description="Enables Bank109 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK110_EN" description="When 1, enables Bank110 of the SRAM" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="BNK110_EN_0" value="0x0" description="Disables Bank110 of the SRAM"/>
            <bitenum id="BNK110_EN_1" value="0x1" description="Enables Bank110 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK111_EN" description="When 1, enables Bank111 of the SRAM" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="BNK111_EN_0" value="0x0" description="Disables Bank111 of the SRAM"/>
            <bitenum id="BNK111_EN_1" value="0x1" description="Enables Bank111 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK112_EN" description="When 1, enables Bank112 of the SRAM" begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="BNK112_EN_0" value="0x0" description="Disables Bank112 of the SRAM"/>
            <bitenum id="BNK112_EN_1" value="0x1" description="Enables Bank112 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK113_EN" description="When 1, enables Bank113 of the SRAM" begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="BNK113_EN_0" value="0x0" description="Disables Bank113 of the SRAM"/>
            <bitenum id="BNK113_EN_1" value="0x1" description="Enables Bank113 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK114_EN" description="When 1, enables Bank114 of the SRAM" begin="18" end="18" width="1" rwaccess="R/W">
            <bitenum id="BNK114_EN_0" value="0x0" description="Disables Bank114 of the SRAM"/>
            <bitenum id="BNK114_EN_1" value="0x1" description="Enables Bank114 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK115_EN" description="When 1, enables Bank115 of the SRAM" begin="19" end="19" width="1" rwaccess="R/W">
            <bitenum id="BNK115_EN_0" value="0x0" description="Disables Bank115 of the SRAM"/>
            <bitenum id="BNK115_EN_1" value="0x1" description="Enables Bank115 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK116_EN" description="When 1, enables Bank116 of the SRAM" begin="20" end="20" width="1" rwaccess="R/W">
            <bitenum id="BNK116_EN_0" value="0x0" description="Disables Bank116 of the SRAM"/>
            <bitenum id="BNK116_EN_1" value="0x1" description="Enables Bank116 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK117_EN" description="When 1, enables Bank117 of the SRAM" begin="21" end="21" width="1" rwaccess="R/W">
            <bitenum id="BNK117_EN_0" value="0x0" description="Disables Bank117 of the SRAM"/>
            <bitenum id="BNK117_EN_1" value="0x1" description="Enables Bank117 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK118_EN" description="When 1, enables Bank118 of the SRAM" begin="22" end="22" width="1" rwaccess="R/W">
            <bitenum id="BNK118_EN_0" value="0x0" description="Disables Bank118 of the SRAM"/>
            <bitenum id="BNK118_EN_1" value="0x1" description="Enables Bank118 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK119_EN" description="When 1, enables Bank119 of the SRAM" begin="23" end="23" width="1" rwaccess="R/W">
            <bitenum id="BNK119_EN_0" value="0x0" description="Disables Bank119 of the SRAM"/>
            <bitenum id="BNK119_EN_1" value="0x1" description="Enables Bank119 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK120_EN" description="When 1, enables Bank120 of the SRAM" begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="BNK120_EN_0" value="0x0" description="Disables Bank120 of the SRAM"/>
            <bitenum id="BNK120_EN_1" value="0x1" description="Enables Bank120 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK121_EN" description="When 1, enables Bank121 of the SRAM" begin="25" end="25" width="1" rwaccess="R/W">
            <bitenum id="BNK121_EN_0" value="0x0" description="Disables Bank121 of the SRAM"/>
            <bitenum id="BNK121_EN_1" value="0x1" description="Enables Bank121 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK122_EN" description="When 1, enables Bank122 of the SRAM" begin="26" end="26" width="1" rwaccess="R/W">
            <bitenum id="BNK122_EN_0" value="0x0" description="Disables Bank122 of the SRAM"/>
            <bitenum id="BNK122_EN_1" value="0x1" description="Enables Bank122 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK123_EN" description="When 1, enables Bank123 of the SRAM" begin="27" end="27" width="1" rwaccess="R/W">
            <bitenum id="BNK123_EN_0" value="0x0" description="Disables Bank123 of the SRAM"/>
            <bitenum id="BNK123_EN_1" value="0x1" description="Enables Bank123 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK124_EN" description="When 1, enables Bank124 of the SRAM" begin="28" end="28" width="1" rwaccess="R/W">
            <bitenum id="BNK124_EN_0" value="0x0" description="Disables Bank124 of the SRAM"/>
            <bitenum id="BNK124_EN_1" value="0x1" description="Enables Bank124 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK125_EN" description="When 1, enables Bank125 of the SRAM" begin="29" end="29" width="1" rwaccess="R/W">
            <bitenum id="BNK125_EN_0" value="0x0" description="Disables Bank125 of the SRAM"/>
            <bitenum id="BNK125_EN_1" value="0x1" description="Enables Bank125 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK126_EN" description="When 1, enables Bank126 of the SRAM" begin="30" end="30" width="1" rwaccess="R/W">
            <bitenum id="BNK126_EN_0" value="0x0" description="Disables Bank126 of the SRAM"/>
            <bitenum id="BNK126_EN_1" value="0x1" description="Enables Bank126 of the SRAM"/>
        </bitfield>
        <bitfield id="BNK127_EN" description="When 1, enables Bank127 of the SRAM" begin="31" end="31" width="1" rwaccess="R/W">
            <bitenum id="BNK127_EN_0" value="0x0" description="Disables Bank127 of the SRAM"/>
            <bitenum id="BNK127_EN_1" value="0x1" description="Enables Bank127 of the SRAM"/>
        </bitfield>
    </register>
    <register id="SYS_SRAM_BLKRET_CTL0" width="32" offset="0x70" internal="0" description="SRAM Block Retention Control Register 0">
        <bitfield id="BLK0_EN" description="Block0 is always retained in LPM3, LPM4 and LPM3.5 modes of operation" begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="BLK1_EN" description="When 1, Block1 of the SRAM is retained in LPM3 and LPM4" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="BLK1_EN_0" value="0x0" description="Block1 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK1_EN_1" value="0x1" description="Block1 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK2_EN" description="When 1, Block2 of the SRAM is retained in LPM3 and LPM4" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="BLK2_EN_0" value="0x0" description="Block2 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK2_EN_1" value="0x1" description="Block2 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK3_EN" description="When 1, Block3 of the SRAM is retained in LPM3 and LPM4" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="BLK3_EN_0" value="0x0" description="Block3 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK3_EN_1" value="0x1" description="Block3 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK4_EN" description="When 1, Block4 of the SRAM is retained in LPM3 and LPM4" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="BLK4_EN_0" value="0x0" description="Block4 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK4_EN_1" value="0x1" description="Block4 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK5_EN" description="When 1, Block5 of the SRAM is retained in LPM3 and LPM4" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="BLK5_EN_0" value="0x0" description="Block5 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK5_EN_1" value="0x1" description="Block5 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK6_EN" description="When 1, Block6 of the SRAM is retained in LPM3 and LPM4" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="BLK6_EN_0" value="0x0" description="Block6 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK6_EN_1" value="0x1" description="Block6 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK7_EN" description="When 1, Block7 of the SRAM is retained in LPM3 and LPM4" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="BLK7_EN_0" value="0x0" description="Block7 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK7_EN_1" value="0x1" description="Block7 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK8_EN" description="When 1, Block8 of the SRAM is retained in LPM3 and LPM4" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="BLK8_EN_0" value="0x0" description="Block8 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK8_EN_1" value="0x1" description="Block8 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK9_EN" description="When 1, Block9 of the SRAM is retained in LPM3 and LPM4" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="BLK9_EN_0" value="0x0" description="Block9 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK9_EN_1" value="0x1" description="Block9 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK10_EN" description="When 1, Block10 of the SRAM is retained in LPM3 and LPM4" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="BLK10_EN_0" value="0x0" description="Block10 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK10_EN_1" value="0x1" description="Block10 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK11_EN" description="When 1, Block11 of the SRAM is retained in LPM3 and LPM4" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="BLK11_EN_0" value="0x0" description="Block11 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK11_EN_1" value="0x1" description="Block11 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK12_EN" description="When 1, Block12 of the SRAM is retained in LPM3 and LPM4" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="BLK12_EN_0" value="0x0" description="Block12 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK12_EN_1" value="0x1" description="Block12 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK13_EN" description="When 1, Block13 of the SRAM is retained in LPM3 and LPM4" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="BLK13_EN_0" value="0x0" description="Block13 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK13_EN_1" value="0x1" description="Block13 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK14_EN" description="When 1, Block14 of the SRAM is retained in LPM3 and LPM4" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="BLK14_EN_0" value="0x0" description="Block14 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK14_EN_1" value="0x1" description="Block14 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK15_EN" description="When 1, Block15 of the SRAM is retained in LPM3 and LPM4" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="BLK15_EN_0" value="0x0" description="Block15 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK15_EN_1" value="0x1" description="Block15 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK16_EN" description="When 1, Block16 of the SRAM is retained in LPM3 and LPM4" begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="BLK16_EN_0" value="0x0" description="Block16 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK16_EN_1" value="0x1" description="Block16 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK17_EN" description="When 1, Block17 of the SRAM is retained in LPM3 and LPM4" begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="BLK17_EN_0" value="0x0" description="Block17 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK17_EN_1" value="0x1" description="Block17 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK18_EN" description="When 1, Block18 of the SRAM is retained in LPM3 and LPM4" begin="18" end="18" width="1" rwaccess="R/W">
            <bitenum id="BLK18_EN_0" value="0x0" description="Block18 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK18_EN_1" value="0x1" description="Block18 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK19_EN" description="When 1, Block19 of the SRAM is retained in LPM3 and LPM4" begin="19" end="19" width="1" rwaccess="R/W">
            <bitenum id="BLK19_EN_0" value="0x0" description="Block19 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK19_EN_1" value="0x1" description="Block19 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK20_EN" description="When 1, Block20 of the SRAM is retained in LPM3 and LPM4" begin="20" end="20" width="1" rwaccess="R/W">
            <bitenum id="BLK20_EN_0" value="0x0" description="Block20 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK20_EN_1" value="0x1" description="Block20 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK21_EN" description="When 1, Block21 of the SRAM is retained in LPM3 and LPM4" begin="21" end="21" width="1" rwaccess="R/W">
            <bitenum id="BLK21_EN_0" value="0x0" description="Block21 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK21_EN_1" value="0x1" description="Block21 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK22_EN" description="When 1, Block22 of the SRAM is retained in LPM3 and LPM4" begin="22" end="22" width="1" rwaccess="R/W">
            <bitenum id="BLK22_EN_0" value="0x0" description="Block22 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK22_EN_1" value="0x1" description="Block22 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK23_EN" description="When 1, Block23 of the SRAM is retained in LPM3 and LPM4" begin="23" end="23" width="1" rwaccess="R/W">
            <bitenum id="BLK23_EN_0" value="0x0" description="Block23 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK23_EN_1" value="0x1" description="Block23 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK24_EN" description="When 1, Block24 of the SRAM is retained in LPM3 and LPM4" begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="BLK24_EN_0" value="0x0" description="Block24 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK24_EN_1" value="0x1" description="Block24 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK25_EN" description="When 1, Block25 of the SRAM is retained in LPM3 and LPM4" begin="25" end="25" width="1" rwaccess="R/W">
            <bitenum id="BLK25_EN_0" value="0x0" description="Block25 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK25_EN_1" value="0x1" description="Block25 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK26_EN" description="When 1, Block26 of the SRAM is retained in LPM3 and LPM4" begin="26" end="26" width="1" rwaccess="R/W">
            <bitenum id="BLK26_EN_0" value="0x0" description="Block26 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK26_EN_1" value="0x1" description="Block26 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK27_EN" description="When 1, Block27 of the SRAM is retained in LPM3 and LPM4" begin="27" end="27" width="1" rwaccess="R/W">
            <bitenum id="BLK27_EN_0" value="0x0" description="Block27 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK27_EN_1" value="0x1" description="Block27 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK28_EN" description="When 1, Block28 of the SRAM is retained in LPM3 and LPM4" begin="28" end="28" width="1" rwaccess="R/W">
            <bitenum id="BLK28_EN_0" value="0x0" description="Block28 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK28_EN_1" value="0x1" description="Block28 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK29_EN" description="When 1, Block29 of the SRAM is retained in LPM3 and LPM4" begin="29" end="29" width="1" rwaccess="R/W">
            <bitenum id="BLK29_EN_0" value="0x0" description="Block29 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK29_EN_1" value="0x1" description="Block29 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK30_EN" description="When 1, Block30 of the SRAM is retained in LPM3 and LPM4" begin="30" end="30" width="1" rwaccess="R/W">
            <bitenum id="BLK30_EN_0" value="0x0" description="Block30 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK30_EN_1" value="0x1" description="Block30 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK31_EN" description="When 1, Block31 of the SRAM is retained in LPM3 and LPM4" begin="31" end="31" width="1" rwaccess="R/W">
            <bitenum id="BLK31_EN_0" value="0x0" description="Block31 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK31_EN_1" value="0x1" description="Block31 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
    </register>
