IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/MSP432/SYSCTL_A_356.0.xml
    <register id="SYS_SRAM_BLKRET_CTL1" width="32" offset="0x74" internal="0" description="SRAM Block Retention Control Register 1">
        <bitfield id="BLK32_EN" description="When 1, Block32 of the SRAM is retained in LPM3 and LPM4" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="BLK32_EN_0" value="0x0" description="Block32 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK32_EN_1" value="0x1" description="Block32 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK33_EN" description="When 1, Block33 of the SRAM is retained in LPM3 and LPM4" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="BLK33_EN_0" value="0x0" description="Block33 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK33_EN_1" value="0x1" description="Block33 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK34_EN" description="When 1, Block34 of the SRAM is retained in LPM3 and LPM4" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="BLK34_EN_0" value="0x0" description="Block34 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK34_EN_1" value="0x1" description="Block34 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK35_EN" description="When 1, Block35 of the SRAM is retained in LPM3 and LPM4" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="BLK35_EN_0" value="0x0" description="Block35 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK35_EN_1" value="0x1" description="Block35 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK36_EN" description="When 1, Block36 of the SRAM is retained in LPM3 and LPM4" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="BLK36_EN_0" value="0x0" description="Block36 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK36_EN_1" value="0x1" description="Block36 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK37_EN" description="When 1, Block37 of the SRAM is retained in LPM3 and LPM4" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="BLK37_EN_0" value="0x0" description="Block37 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK37_EN_1" value="0x1" description="Block37 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK38_EN" description="When 1, Block38 of the SRAM is retained in LPM3 and LPM4" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="BLK38_EN_0" value="0x0" description="Block38 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK38_EN_1" value="0x1" description="Block38 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK39_EN" description="When 1, Block39 of the SRAM is retained in LPM3 and LPM4" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="BLK39_EN_0" value="0x0" description="Block39 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK39_EN_1" value="0x1" description="Block39 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK40_EN" description="When 1, Block40 of the SRAM is retained in LPM3 and LPM4" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="BLK40_EN_0" value="0x0" description="Block40 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK40_EN_1" value="0x1" description="Block40 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK41_EN" description="When 1, Block41 of the SRAM is retained in LPM3 and LPM4" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="BLK41_EN_0" value="0x0" description="Block41 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK41_EN_1" value="0x1" description="Block41 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK42_EN" description="When 1, Block42 of the SRAM is retained in LPM3 and LPM4" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="BLK42_EN_0" value="0x0" description="Block42 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK42_EN_1" value="0x1" description="Block42 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK43_EN" description="When 1, Block43 of the SRAM is retained in LPM3 and LPM4" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="BLK43_EN_0" value="0x0" description="Block43 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK43_EN_1" value="0x1" description="Block43 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK44_EN" description="When 1, Block44 of the SRAM is retained in LPM3 and LPM4" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="BLK44_EN_0" value="0x0" description="Block44 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK44_EN_1" value="0x1" description="Block44 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK45_EN" description="When 1, Block45 of the SRAM is retained in LPM3 and LPM4" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="BLK45_EN_0" value="0x0" description="Block45 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK45_EN_1" value="0x1" description="Block45 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK46_EN" description="When 1, Block46 of the SRAM is retained in LPM3 and LPM4" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="BLK46_EN_0" value="0x0" description="Block46 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK46_EN_1" value="0x1" description="Block46 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK47_EN" description="When 1, Block47 of the SRAM is retained in LPM3 and LPM4" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="BLK47_EN_0" value="0x0" description="Block47 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK47_EN_1" value="0x1" description="Block47 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK48_EN" description="When 1, Block48 of the SRAM is retained in LPM3 and LPM4" begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="BLK48_EN_0" value="0x0" description="Block48 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK48_EN_1" value="0x1" description="Block48 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK49_EN" description="When 1, Block49 of the SRAM is retained in LPM3 and LPM4" begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="BLK49_EN_0" value="0x0" description="Block49 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK49_EN_1" value="0x1" description="Block49 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK50_EN" description="When 1, Block50 of the SRAM is retained in LPM3 and LPM4" begin="18" end="18" width="1" rwaccess="R/W">
            <bitenum id="BLK50_EN_0" value="0x0" description="Block50 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK50_EN_1" value="0x1" description="Block50 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK51_EN" description="When 1, Block51 of the SRAM is retained in LPM3 and LPM4" begin="19" end="19" width="1" rwaccess="R/W">
            <bitenum id="BLK51_EN_0" value="0x0" description="Block51 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK51_EN_1" value="0x1" description="Block51 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK52_EN" description="When 1, Block52 of the SRAM is retained in LPM3 and LPM4" begin="20" end="20" width="1" rwaccess="R/W">
            <bitenum id="BLK52_EN_0" value="0x0" description="Block52 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK52_EN_1" value="0x1" description="Block52 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK53_EN" description="When 1, Block53 of the SRAM is retained in LPM3 and LPM4" begin="21" end="21" width="1" rwaccess="R/W">
            <bitenum id="BLK53_EN_0" value="0x0" description="Block53 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK53_EN_1" value="0x1" description="Block53 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK54_EN" description="When 1, Block54 of the SRAM is retained in LPM3 and LPM4" begin="22" end="22" width="1" rwaccess="R/W">
            <bitenum id="BLK54_EN_0" value="0x0" description="Block54 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK54_EN_1" value="0x1" description="Block54 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK55_EN" description="When 1, Block55 of the SRAM is retained in LPM3 and LPM4" begin="23" end="23" width="1" rwaccess="R/W">
            <bitenum id="BLK55_EN_0" value="0x0" description="Block55 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK55_EN_1" value="0x1" description="Block55 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK56_EN" description="When 1, Block56 of the SRAM is retained in LPM3 and LPM4" begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="BLK56_EN_0" value="0x0" description="Block56 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK56_EN_1" value="0x1" description="Block56 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK57_EN" description="When 1, Block57 of the SRAM is retained in LPM3 and LPM4" begin="25" end="25" width="1" rwaccess="R/W">
            <bitenum id="BLK57_EN_0" value="0x0" description="Block57 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK57_EN_1" value="0x1" description="Block57 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK58_EN" description="When 1, Block58 of the SRAM is retained in LPM3 and LPM4" begin="26" end="26" width="1" rwaccess="R/W">
            <bitenum id="BLK58_EN_0" value="0x0" description="Block58 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK58_EN_1" value="0x1" description="Block58 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK59_EN" description="When 1, Block59 of the SRAM is retained in LPM3 and LPM4" begin="27" end="27" width="1" rwaccess="R/W">
            <bitenum id="BLK59_EN_0" value="0x0" description="Block59 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK59_EN_1" value="0x1" description="Block59 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK60_EN" description="When 1, Block60 of the SRAM is retained in LPM3 and LPM4" begin="28" end="28" width="1" rwaccess="R/W">
            <bitenum id="BLK60_EN_0" value="0x0" description="Block60 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK60_EN_1" value="0x1" description="Block60 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK61_EN" description="When 1, Block61 of the SRAM is retained in LPM3 and LPM4" begin="29" end="29" width="1" rwaccess="R/W">
            <bitenum id="BLK61_EN_0" value="0x0" description="Block61 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK61_EN_1" value="0x1" description="Block61 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK62_EN" description="When 1, Block62 of the SRAM is retained in LPM3 and LPM4" begin="30" end="30" width="1" rwaccess="R/W">
            <bitenum id="BLK62_EN_0" value="0x0" description="Block62 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK62_EN_1" value="0x1" description="Block62 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK63_EN" description="When 1, Block63 of the SRAM is retained in LPM3 and LPM4" begin="31" end="31" width="1" rwaccess="R/W">
            <bitenum id="BLK63_EN_0" value="0x0" description="Block63 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK63_EN_1" value="0x1" description="Block63 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
    </register>
