IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/MSP432/SYSCTL_A_356.0.xml
    <register id="SYS_SRAM_BLKRET_CTL2" width="32" offset="0x78" internal="0" description="SRAM Block Retention Control Register 2">
        <bitfield id="BLK64_EN" description="When 1, Block64 of the SRAM is retained in LPM3 and LPM4" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="BLK64_EN_0" value="0x0" description="Block64 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK64_EN_1" value="0x1" description="Block64 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK65_EN" description="When 1, Block65 of the SRAM is retained in LPM3 and LPM4" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="BLK65_EN_0" value="0x0" description="Block65 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK65_EN_1" value="0x1" description="Block65 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK66_EN" description="When 1, Block66 of the SRAM is retained in LPM3 and LPM4" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="BLK66_EN_0" value="0x0" description="Block66 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK66_EN_1" value="0x1" description="Block66 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK67_EN" description="When 1, Block67 of the SRAM is retained in LPM3 and LPM4" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="BLK67_EN_0" value="0x0" description="Block67 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK67_EN_1" value="0x1" description="Block67 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK68_EN" description="When 1, Block68 of the SRAM is retained in LPM3 and LPM4" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="BLK68_EN_0" value="0x0" description="Block68 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK68_EN_1" value="0x1" description="Block68 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK69_EN" description="When 1, Block69 of the SRAM is retained in LPM3 and LPM4" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="BLK69_EN_0" value="0x0" description="Block69 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK69_EN_1" value="0x1" description="Block69 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK70_EN" description="When 1, Block70 of the SRAM is retained in LPM3 and LPM4" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="BLK70_EN_0" value="0x0" description="Block70 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK70_EN_1" value="0x1" description="Block70 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK71_EN" description="When 1, Block71 of the SRAM is retained in LPM3 and LPM4" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="BLK71_EN_0" value="0x0" description="Block71 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK71_EN_1" value="0x1" description="Block71 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK72_EN" description="When 1, Block72 of the SRAM is retained in LPM3 and LPM4" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="BLK72_EN_0" value="0x0" description="Block72 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK72_EN_1" value="0x1" description="Block72 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK73_EN" description="When 1, Block73 of the SRAM is retained in LPM3 and LPM4" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="BLK73_EN_0" value="0x0" description="Block73 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK73_EN_1" value="0x1" description="Block73 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK74_EN" description="When 1, Block74 of the SRAM is retained in LPM3 and LPM4" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="BLK74_EN_0" value="0x0" description="Block74 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK74_EN_1" value="0x1" description="Block74 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK75_EN" description="When 1, Block75 of the SRAM is retained in LPM3 and LPM4" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="BLK75_EN_0" value="0x0" description="Block75 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK75_EN_1" value="0x1" description="Block75 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK76_EN" description="When 1, Block76 of the SRAM is retained in LPM3 and LPM4" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="BLK76_EN_0" value="0x0" description="Block76 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK76_EN_1" value="0x1" description="Block76 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK77_EN" description="When 1, Block77 of the SRAM is retained in LPM3 and LPM4" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="BLK77_EN_0" value="0x0" description="Block77 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK77_EN_1" value="0x1" description="Block77 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK78_EN" description="When 1, Block78 of the SRAM is retained in LPM3 and LPM4" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="BLK78_EN_0" value="0x0" description="Block78 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK78_EN_1" value="0x1" description="Block78 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK79_EN" description="When 1, Block79 of the SRAM is retained in LPM3 and LPM4" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="BLK79_EN_0" value="0x0" description="Block79 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK79_EN_1" value="0x1" description="Block79 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK80_EN" description="When 1, Block80 of the SRAM is retained in LPM3 and LPM4" begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="BLK80_EN_0" value="0x0" description="Block80 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK80_EN_1" value="0x1" description="Block80 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK81_EN" description="When 1, Block81 of the SRAM is retained in LPM3 and LPM4" begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="BLK81_EN_0" value="0x0" description="Block81 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK81_EN_1" value="0x1" description="Block81 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK82_EN" description="When 1, Block82 of the SRAM is retained in LPM3 and LPM4" begin="18" end="18" width="1" rwaccess="R/W">
            <bitenum id="BLK82_EN_0" value="0x0" description="Block82 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK82_EN_1" value="0x1" description="Block82 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK83_EN" description="When 1, Block83 of the SRAM is retained in LPM3 and LPM4" begin="19" end="19" width="1" rwaccess="R/W">
            <bitenum id="BLK83_EN_0" value="0x0" description="Block83 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK83_EN_1" value="0x1" description="Block83 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK84_EN" description="When 1, Block84 of the SRAM is retained in LPM3 and LPM4" begin="20" end="20" width="1" rwaccess="R/W">
            <bitenum id="BLK84_EN_0" value="0x0" description="Block84 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK84_EN_1" value="0x1" description="Block84 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK85_EN" description="When 1, Block85 of the SRAM is retained in LPM3 and LPM4" begin="21" end="21" width="1" rwaccess="R/W">
            <bitenum id="BLK85_EN_0" value="0x0" description="Block85 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK85_EN_1" value="0x1" description="Block85 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK86_EN" description="When 1, Block86 of the SRAM is retained in LPM3 and LPM4" begin="22" end="22" width="1" rwaccess="R/W">
            <bitenum id="BLK86_EN_0" value="0x0" description="Block86 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK86_EN_1" value="0x1" description="Block86 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK87_EN" description="When 1, Block87 of the SRAM is retained in LPM3 and LPM4" begin="23" end="23" width="1" rwaccess="R/W">
            <bitenum id="BLK87_EN_0" value="0x0" description="Block87 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK87_EN_1" value="0x1" description="Block87 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK88_EN" description="When 1, Block88 of the SRAM is retained in LPM3 and LPM4" begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="BLK88_EN_0" value="0x0" description="Block88 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK88_EN_1" value="0x1" description="Block88 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK89_EN" description="When 1, Block89 of the SRAM is retained in LPM3 and LPM4" begin="25" end="25" width="1" rwaccess="R/W">
            <bitenum id="BLK89_EN_0" value="0x0" description="Block89 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK89_EN_1" value="0x1" description="Block89 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK90_EN" description="When 1, Block90 of the SRAM is retained in LPM3 and LPM4" begin="26" end="26" width="1" rwaccess="R/W">
            <bitenum id="BLK90_EN_0" value="0x0" description="Block90 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK90_EN_1" value="0x1" description="Block90 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK91_EN" description="When 1, Block91 of the SRAM is retained in LPM3 and LPM4" begin="27" end="27" width="1" rwaccess="R/W">
            <bitenum id="BLK91_EN_0" value="0x0" description="Block91 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK91_EN_1" value="0x1" description="Block91 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK92_EN" description="When 1, Block92 of the SRAM is retained in LPM3 and LPM4" begin="28" end="28" width="1" rwaccess="R/W">
            <bitenum id="BLK92_EN_0" value="0x0" description="Block92 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK92_EN_1" value="0x1" description="Block92 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK93_EN" description="When 1, Block93 of the SRAM is retained in LPM3 and LPM4" begin="29" end="29" width="1" rwaccess="R/W">
            <bitenum id="BLK93_EN_0" value="0x0" description="Block93 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK93_EN_1" value="0x1" description="Block93 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK94_EN" description="When 1, Block94 of the SRAM is retained in LPM3 and LPM4" begin="30" end="30" width="1" rwaccess="R/W">
            <bitenum id="BLK94_EN_0" value="0x0" description="Block94 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK94_EN_1" value="0x1" description="Block94 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK95_EN" description="When 1, Block95 of the SRAM is retained in LPM3 and LPM4" begin="31" end="31" width="1" rwaccess="R/W">
            <bitenum id="BLK95_EN_0" value="0x0" description="Block95 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK95_EN_1" value="0x1" description="Block95 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
    </register>
