IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/MSP432/SYSCTL_A_356.0.xml
    <register id="SYS_SRAM_BLKRET_CTL3" width="32" offset="0x7C" internal="0" description="SRAM Block Retention Control Register 3">
        <bitfield id="BLK96_EN" description="When 1, Block96 of the SRAM is retained in LPM3 and LPM4" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="BLK96_EN_0" value="0x0" description="Block96 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK96_EN_1" value="0x1" description="Block96 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK97_EN" description="When 1, Block97 of the SRAM is retained in LPM3 and LPM4" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="BLK97_EN_0" value="0x0" description="Block97 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK97_EN_1" value="0x1" description="Block97 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK98_EN" description="When 1, Block98 of the SRAM is retained in LPM3 and LPM4" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="BLK98_EN_0" value="0x0" description="Block98 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK98_EN_1" value="0x1" description="Block98 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK99_EN" description="When 1, Block99 of the SRAM is retained in LPM3 and LPM4" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="BLK99_EN_0" value="0x0" description="Block99 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK99_EN_1" value="0x1" description="Block99 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK100_EN" description="When 1, Block100 of the SRAM is retained in LPM3 and LPM4" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="BLK100_EN_0" value="0x0" description="Block100 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK100_EN_1" value="0x1" description="Block100 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK101_EN" description="When 1, Block101 of the SRAM is retained in LPM3 and LPM4" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="BLK101_EN_0" value="0x0" description="Block101 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK101_EN_1" value="0x1" description="Block101 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK102_EN" description="When 1, Block102 of the SRAM is retained in LPM3 and LPM4" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="BLK102_EN_0" value="0x0" description="Block102 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK102_EN_1" value="0x1" description="Block102 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK103_EN" description="When 1, Block103 of the SRAM is retained in LPM3 and LPM4" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="BLK103_EN_0" value="0x0" description="Block103 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK103_EN_1" value="0x1" description="Block103 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK104_EN" description="When 1, Block104 of the SRAM is retained in LPM3 and LPM4" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="BLK104_EN_0" value="0x0" description="Block104 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK104_EN_1" value="0x1" description="Block104 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK105_EN" description="When 1, Block105 of the SRAM is retained in LPM3 and LPM4" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="BLK105_EN_0" value="0x0" description="Block105 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK105_EN_1" value="0x1" description="Block105 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK106_EN" description="When 1, Block106 of the SRAM is retained in LPM3 and LPM4" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="BLK106_EN_0" value="0x0" description="Block106 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK106_EN_1" value="0x1" description="Block106 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK107_EN" description="When 1, Block107 of the SRAM is retained in LPM3 and LPM4" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="BLK107_EN_0" value="0x0" description="Block107 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK107_EN_1" value="0x1" description="Block107 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK108_EN" description="When 1, Block108 of the SRAM is retained in LPM3 and LPM4" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="BLK108_EN_0" value="0x0" description="Block108 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK108_EN_1" value="0x1" description="Block108 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK109_EN" description="When 1, Block109 of the SRAM is retained in LPM3 and LPM4" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="BLK109_EN_0" value="0x0" description="Block109 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK109_EN_1" value="0x1" description="Block109 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK110_EN" description="When 1, Block110 of the SRAM is retained in LPM3 and LPM4" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="BLK110_EN_0" value="0x0" description="Block110 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK110_EN_1" value="0x1" description="Block110 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK111_EN" description="When 1, Block111 of the SRAM is retained in LPM3 and LPM4" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="BLK111_EN_0" value="0x0" description="Block111 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK111_EN_1" value="0x1" description="Block111 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK112_EN" description="When 1, Block112 of the SRAM is retained in LPM3 and LPM4" begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="BLK112_EN_0" value="0x0" description="Block112 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK112_EN_1" value="0x1" description="Block112 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK113_EN" description="When 1, Block113 of the SRAM is retained in LPM3 and LPM4" begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="BLK113_EN_0" value="0x0" description="Block113 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK113_EN_1" value="0x1" description="Block113 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK114_EN" description="When 1, Block114 of the SRAM is retained in LPM3 and LPM4" begin="18" end="18" width="1" rwaccess="R/W">
            <bitenum id="BLK114_EN_0" value="0x0" description="Block114 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK114_EN_1" value="0x1" description="Block114 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK115_EN" description="When 1, Block115 of the SRAM is retained in LPM3 and LPM4" begin="19" end="19" width="1" rwaccess="R/W">
            <bitenum id="BLK115_EN_0" value="0x0" description="Block115 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK115_EN_1" value="0x1" description="Block115 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK116_EN" description="When 1, Block116 of the SRAM is retained in LPM3 and LPM4" begin="20" end="20" width="1" rwaccess="R/W">
            <bitenum id="BLK116_EN_0" value="0x0" description="Block116 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK116_EN_1" value="0x1" description="Block116 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK117_EN" description="When 1, Block117 of the SRAM is retained in LPM3 and LPM4" begin="21" end="21" width="1" rwaccess="R/W">
            <bitenum id="BLK117_EN_0" value="0x0" description="Block117 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK117_EN_1" value="0x1" description="Block117 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK118_EN" description="When 1, Block118 of the SRAM is retained in LPM3 and LPM4" begin="22" end="22" width="1" rwaccess="R/W">
            <bitenum id="BLK118_EN_0" value="0x0" description="Block118 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK118_EN_1" value="0x1" description="Block118 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK119_EN" description="When 1, Block119 of the SRAM is retained in LPM3 and LPM4" begin="23" end="23" width="1" rwaccess="R/W">
            <bitenum id="BLK119_EN_0" value="0x0" description="Block119 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK119_EN_1" value="0x1" description="Block119 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK120_EN" description="When 1, Block120 of the SRAM is retained in LPM3 and LPM4" begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="BLK120_EN_0" value="0x0" description="Block120 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK120_EN_1" value="0x1" description="Block120 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK121_EN" description="When 1, Block121 of the SRAM is retained in LPM3 and LPM4" begin="25" end="25" width="1" rwaccess="R/W">
            <bitenum id="BLK121_EN_0" value="0x0" description="Block121 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK121_EN_1" value="0x1" description="Block121 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK122_EN" description="When 1, Block122 of the SRAM is retained in LPM3 and LPM4" begin="26" end="26" width="1" rwaccess="R/W">
            <bitenum id="BLK122_EN_0" value="0x0" description="Block122 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK122_EN_1" value="0x1" description="Block122 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK123_EN" description="When 1, Block123 of the SRAM is retained in LPM3 and LPM4" begin="27" end="27" width="1" rwaccess="R/W">
            <bitenum id="BLK123_EN_0" value="0x0" description="Block123 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK123_EN_1" value="0x1" description="Block123 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK124_EN" description="When 1, Block124 of the SRAM is retained in LPM3 and LPM4" begin="28" end="28" width="1" rwaccess="R/W">
            <bitenum id="BLK124_EN_0" value="0x0" description="Block124 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK124_EN_1" value="0x1" description="Block124 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK125_EN" description="When 1, Block125 of the SRAM is retained in LPM3 and LPM4" begin="29" end="29" width="1" rwaccess="R/W">
            <bitenum id="BLK125_EN_0" value="0x0" description="Block125 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK125_EN_1" value="0x1" description="Block125 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK126_EN" description="When 1, Block126 of the SRAM is retained in LPM3 and LPM4" begin="30" end="30" width="1" rwaccess="R/W">
            <bitenum id="BLK126_EN_0" value="0x0" description="Block126 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK126_EN_1" value="0x1" description="Block126 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
        <bitfield id="BLK127_EN" description="When 1, Block127 of the SRAM is retained in LPM3 and LPM4" begin="31" end="31" width="1" rwaccess="R/W">
            <bitenum id="BLK127_EN_0" value="0x0" description="Block127 of the SRAM is not retained in LPM3 or LPM4"/>
            <bitenum id="BLK127_EN_1" value="0x1" description="Block127 of the SRAM is retained in LPM3 and LPM4"/>
        </bitfield>
    </register>
    <register id="SYS_SRAM_STAT" width="32" offset="0x90" internal="0" description="SRAM Status Register">
        <bitfield id="BNKEN_RDY" description="When 1, indicates SRAM is ready for access and banks can be enabled/disabled." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="BNKEN_RDY_0" value="0x0" description="SRAM is not ready for accesses. Banks are undergoing an enable or disable sequence, and reads or writes to SRAM are stalled until the banks are ready."/>
            <bitenum id="BNKEN_RDY_1" value="0x1" description="SRAM is ready for accesses. All SRAM banks are enabled/disabled according to values of registers SYS_SRAM_BANKEN_CTLx (x=0,1,2,3)"/>
        </bitfield>
        <bitfield id="BLKRET_RDY" description="When 1, indicates SRAM is ready for access and blocks can be enabled/disabled for retention." begin="1" end="1" width="1" rwaccess="R">
            <bitenum id="BLKRET_RDY_0" value="0x0" description="SRAM blocks are being set up for retention. Entry into LPM3, LPM4 should not be attempted until this bit is set to 1"/>
            <bitenum id="BLKRET_RDY_1" value="0x1" description="SRAM is ready for accesses. All SRAM blocks are enabled/disabled for retention according to values of registers SYS_SRAM_BLKRET_CTLx (x = 0,1,2,3)"/>
        </bitfield>
    </register>
    <register id="SYS_MASTER_UNLOCK" width="32" offset="0x1000" internal="0" description="Master Unlock Register">
        <bitfield id="UNLKEY" description="Unlock Key" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYS_BOOTOVER_REQ0" width="32" offset="0x1004" internal="0" description="Boot Override Request Register">
    </register>
    <register id="SYS_BOOTOVER_REQ1" width="32" offset="0x1008" internal="0" description="Boot Override Request Register">
    </register>
