IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/MSP432/SYSCTL_A_356.0.xml
    <register id="SYS_BOOTOVER_ACK" width="32" offset="0x100C" internal="0" description="Boot Override Acknowledge Register">
    </register>
    <register id="SYS_RESET_REQ" width="32" offset="0x1010" internal="0" description="Reset Request Register">
        <bitfield id="POR" description="Generate POR" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="REBOOT" description="Generate Reboot_Reset" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="WKEY" description="Write key" begin="15" end="8" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYS_RESET_STATOVER" width="32" offset="0x1014" internal="0" description="Reset Status and Override Register">
        <bitfield id="SOFT" description="Indicates if SOFT Reset is active" begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="HARD" description="Indicates if HARD Reset is active" begin="1" end="1" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="REBOOT" description="Indicates if Reboot Reset is active" begin="2" end="2" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="SOFT_OVER" description="SOFT_Reset overwrite request" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="HARD_OVER" description="HARD_Reset overwrite request" begin="9" end="9" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="RBT_OVER" description="Reboot Reset overwrite request" begin="10" end="10" width="1" rwaccess="R/W">
        </bitfield>
    </register>
</module>
